[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.jsx:53:23
           type="text"
           isInvalid={Boolean(errors.requesterEmail)}
           {...register("requesterEmail", {
-            required: "Requester email is required.",
+            required: "",
           })}
         />
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Requester email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
