[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestTable.jsx:47:5
       header: "Requester Email",
       accessorKey: "requesterEmail",
     },
-    {
-      header: "Professor Email",
-      accessorKey: "professorEmail",
-    },
+    {},
     {
       header: "Explanation",
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestTable.jsx:55:5
       header: "Explanation",
       accessorKey: "explanation",
     },
-    {
-      header: "Date Requested (iso format)",
-      accessorKey: "dateRequested",
-    },
+    {},
     {
       header: "Date Needed (iso format)",
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.jsx:56:15
       accessorKey: "explanation",
     },
     {
-      header: "Date Requested (iso format)",
+      header: "",
       accessorKey: "dateRequested",
     },
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Date Requested (iso format). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"
