[Killed] ArrowFunction
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequests",
-    method: "PUT",
-    params: {
-      id: recommendationRequest.id,
-    },
-    data: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "RecommendationRequest Updated - id: 17 requesterEmail: bob_gaucho@ucsb.edu",
