[Killed] StringLiteral
main/components/Articles/ArticleForm.jsx:46:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="title">Title</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-title"}
+          data-testid={testIdPrefix + ""}
           id="title"
           type="text"
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="ArticleForm-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/Articles/ArticleForm.jsx:50:33
           id="title"
           type="text"
           isInvalid={Boolean(errors.title)}
-          {...register("title", {
-            required: "Title is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("title", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticleForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Title is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticleForm.jsx:70:31
           id="url"
           type="text"
           isInvalid={Boolean(errors.url)}
-          {...register("url", {
-            required: "Url is required.",
-          })}
+          {...register("url", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticleForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Url is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticleForm.jsx:70:24
           id="url"
           type="text"
           isInvalid={Boolean(errors.url)}
-          {...register("url", {
+          {...register("", {
             required: "Url is required.",
           })}
killedBy: ArticleForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Articles/ArticleForm.jsx:82:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="explanation">Explanation</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-explanation"}
+          data-testid={testIdPrefix + ""}
           id="explanation"
           type="text"
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="ArticleForm-explanation"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/Articles/ArticleForm.jsx:86:39
           id="explanation"
           type="text"
           isInvalid={Boolean(errors.explanation)}
-          {...register("explanation", {
-            required: "Explanation is required.",
-          })}
+          {...register("explanation", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticleForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Explanation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticleForm.jsx:98:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="email">Email</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-email"}
+          data-testid={testIdPrefix + ""}
           id="email"
           type="text"
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="ArticleForm-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/Articles/ArticleForm.jsx:102:33
           id="email"
           type="text"
           isInvalid={Boolean(errors.email)}
-          {...register("email", {
-            required: "Email is required.",
-          })}
+          {...register("email", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticleForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticleForm.jsx:114:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="dateAdded">Date Added (iso format)</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-dateAdded"}
+          data-testid={testIdPrefix + ""}
           id="dateAdded"
           type="datetime-local"
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="ArticleForm-dateAdded"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/components/Articles/ArticleForm.jsx:119:23
           type="datetime-local"
           isInvalid={Boolean(errors.dateAdded)}
           {...register("dateAdded", {
-            required: true,
+            required: false,
             pattern: isodate_regex,
           })}
killedBy: ArticleForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /DateAdded is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Articles/ArticleForm.jsx:124:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateAdded && "DateAdded is required. "}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: ArticleForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /DateAdded is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Articles/ArticleForm.jsx:124:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateAdded && "DateAdded is required. "}
+          {errors.dateAdded || "DateAdded is required. "}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: ArticleForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Title is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
