[Killed] ConditionalExpression
main/components/HelpRequests/HelpRequestForm.jsx:32:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="HelpRequestForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: HelpRequestForm tests renders correctly with initialContents (edit mode)
statusReason: Unable to find an element with the text: /Id/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequests/HelpRequestForm.jsx:32:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="HelpRequestForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
 
         <Col>
killedBy: HelpRequestForm tests renders correctly with initialContents (edit mode)
statusReason: Unable to find an element with the text: /Id/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] Regex
main/components/HelpRequests/HelpRequestForm.jsx:59:26
               {...register("requesterEmail", {
                 required: "Email is required.",
                 pattern: {
-                  value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
+                  value: /^[^\s@]+@[\s@]+\.[^\s@]+$/,
                   message: "Enter a valid email.",
                 },
killedBy: HelpRequestForm tests no error messages on good input and submitAction called
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] Regex
main/components/HelpRequests/HelpRequestForm.jsx:59:26
               {...register("requesterEmail", {
                 required: "Email is required.",
                 pattern: {
-                  value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
+                  value: /^[^\s@]+@[^\s@]\.[^\s@]+$/,
                   message: "Enter a valid email.",
                 },
killedBy: HelpRequestForm tests no error messages on good input and submitAction called
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:60:28
                 required: "Email is required.",
                 pattern: {
                   value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
-                  message: "Enter a valid email.",
+                  message: "",
                 },
               })}
killedBy: HelpRequestForm tests shows correct error messages on bad input
statusReason: Unable to find an element with the text: /Enter a valid email\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/HelpRequests/HelpRequestForm.jsx:88:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requestTime?.message}
+              {errors.requestTime.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests renders correctly (create mode)
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:103:38
               id="teamId"
               type="text"
               isInvalid={Boolean(errors.teamId)}
-              {...register("teamId", {
-                required: "Team ID is required.",
-              })}
+              {...register("teamId", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests shows required messages on missing input
statusReason: Unable to find an element with the text: /Team ID is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/HelpRequests/HelpRequestForm.jsx:108:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.teamId?.message}
+              {errors.teamId.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests renders correctly (create mode)
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:122:28
               id="tableOrBreakoutRoom"
               type="text"
               isInvalid={Boolean(errors.tableOrBreakoutRoom)}
-              {...register("tableOrBreakoutRoom", {
+              {...register("", {
                 required: "This field is required.",
               })}
killedBy: HelpRequestForm tests renders correctly (create mode)
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/HelpRequests/HelpRequestForm.jsx:127:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.tableOrBreakoutRoom?.message}
+              {errors.tableOrBreakoutRoom.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests renders correctly (create mode)
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:158:28
               type="checkbox"
               label="Solved"
               isInvalid={Boolean(errors.solved)}
-              {...register("solved")}
+              {...register("")}
             />
           </Form.Group>
killedBy: HelpRequestForm tests renders correctly (create mode)
statusReason: Cannot read properties of undefined (reading '_f')
