[Killed] BlockStatement
main/components/MenuItemReview/MenuItemReviewTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/menuitemreview/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: expected "spy" to be called with arguments: [ '/menuitemreview/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/menuitemreview/edit/${cell.row.original.id}`);
+    navigate(``);
   };
 
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: expected "spy" to be called with arguments: [ '/menuitemreview/edit/1' ]

Received: 

  1st spy call:

  [
-   "/menuitemreview/edit/1",

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:42:5
       header: "id",
       accessorKey: "id", // accessor is the "key" in the data
     },
-    {
-      header: "ItemID",
-      accessorKey: "itemId",
-    },
+    {},
     {
       header: "Reviewer Email",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:50:5
       header: "Reviewer Email",
       accessorKey: "reviewerEmail",
     },
-    {
-      header: "Stars",
-      accessorKey: "stars",
-    },
+    {},
     {
       header: "Date Reviewed",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:54:5
       header: "Stars",
       accessorKey: "stars",
     },
-    {
-      header: "Date Reviewed",
-      accessorKey: "dateReviewed",
-    },
+    {},
     {
       header: "Comments",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:58:5
       header: "Date Reviewed",
       accessorKey: "dateReviewed",
     },
-    {
-      header: "Comments",
-      accessorKey: "comments",
-    },
+    {},
   ];
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header
