[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:41:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="orgCode">orgCode</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-orgCode"}
+          data-testid={testIdPrefix + ""}
           id="orgCode"
           type="text"
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:45:24
           id="orgCode"
           type="text"
           isInvalid={Boolean(errors.orgCode)}
-          {...register("orgCode", {
+          {...register("", {
             required: "orgCode is required.",
             maxLength: {
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:47:24
           isInvalid={Boolean(errors.orgCode)}
           {...register("orgCode", {
             required: "orgCode is required.",
-            maxLength: {
-              value: 30,
-              message: "Max length 30 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:83:24
           id="orgTranslation"
           type="text"
           isInvalid={Boolean(errors.orgTranslation)}
-          {...register("orgTranslation", {
+          {...register("", {
             required: "orgTranslation is required.",
           })}
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:98:24
           id="inactive"
           type="checkbox"
           isInvalid={Boolean(errors.inactive)}
-          {...register("inactive")}
+          {...register("")}
         />
         <Form.Control.Feedback type="invalid" className="d-block">
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')
