[Killed] BooleanLiteral
main/pages/Articles/ArticlesCreatePage.jsx:7:58
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function ArticlesCreatePage({ storybook = false }) {
+export default function ArticlesCreatePage({ storybook = true }) {
   const objectToAxiosParams = (article) => ({
     url: "/api/articles/post",
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected "spy" to be called with arguments: [ { to: '/articles' } ]

Number of calls: 0

[Killed] ArrowFunction
main/pages/Articles/ArticlesCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function ArticlesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (article) => ({
-    url: "/api/articles/post",
-    method: "POST",
-    params: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateAdded: article.dateAdded,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (article) => {
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/Articles/ArticlesCreatePage.jsx:9:10
 
 export default function ArticlesCreatePage({ storybook = false }) {
   const objectToAxiosParams = (article) => ({
-    url: "/api/articles/post",
+    url: "",
     method: "POST",
     params: {
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New article Created - id: 1 title: First Article",

[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.jsx:20:34
     },
   });
 
-  const onSuccess = (article) => {
-    toast(`New article Created - id: ${article.id} title: ${article.title}`);
-  };
+  const onSuccess = (article) => {};
 
   const mutation = useBackendMutation(
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.jsx:37:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/articles" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected "spy" to be called with arguments: [ { to: '/articles' } ]

Number of calls: 0
