[Killed] BlockStatement
main/pages/Articles/ArticlesIndexPage.jsx:24:30
     [],
   );
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/articles/create"
-          style={{ float: "right" }}
-        >
-          Create Article
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   return (
killedBy: ArticlesIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create Article/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Articles/ArticlesIndexPage.jsx:25:45
   );
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/articles/create"
-          style={{ float: "right" }}
-        >
-          Create Article
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: ArticlesIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create Article/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/Articles/ArticlesIndexPage.jsx:30:18
         <Button
           variant="primary"
           href="/articles/create"
-          style={{ float: "right" }}
+          style={{}}
         >
           Create Article
killedBy: ArticlesIndexPage tests Renders with Create Button for admin user
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
