[Killed] BlockStatement
main/components/HelpRequests/HelpRequestTable.jsx:15:34
 export default function HelpRequestTable({ requests, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/helprequests/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: expected "spy" to be called with arguments: [ '/helprequests/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.jsx:38:5
       header: "id",
       accessorKey: "id", // accessor is the "key" in the data
     },
-    {
-      header: "Email",
-      accessorKey: "requesterEmail",
-    },
+    {},
     {
       header: "Request Time",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:40:20
     },
     {
       header: "Email",
-      accessorKey: "requesterEmail",
+      accessorKey: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-requesterEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:44:20
     },
     {
       header: "Request Time",
-      accessorKey: "requestTime",
+      accessorKey: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-requestTime"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.jsx:46:5
       header: "Request Time",
       accessorKey: "requestTime",
     },
-    {
-      header: "Team",
-      accessorKey: "teamId",
-    },
+    {},
     {
       header: "Table or Breakout Room",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:47:15
       accessorKey: "requestTime",
     },
     {
-      header: "Team",
+      header: "",
       accessorKey: "teamId",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element with the text: Team. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:60:20
     },
     {
       header: "Solved",
-      accessorKey: "solved",
+      accessorKey: "",
       cell: ({ getValue }) => (getValue() ? "Yes" : "No"),
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-solved"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] ArrowFunction
main/components/HelpRequests/HelpRequestTable.jsx:61:13
     {
       header: "Solved",
       accessorKey: "solved",
-      cell: ({ getValue }) => (getValue() ? "Yes" : "No"),
+      cell: () => undefined,
     },
   ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: expected [ 'Yes', 'No' ] to include ''

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:67:20
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "HelpRequestTable"),
+      ButtonColumn("", "primary", editCallback, "HelpRequestTable"),
     );
     columns.push(
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:67:53
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "HelpRequestTable"),
+      ButtonColumn("Edit", "primary", editCallback, ""),
     );
     columns.push(
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:70:20
       ButtonColumn("Edit", "primary", editCallback, "HelpRequestTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "HelpRequestTable"),
+      ButtonColumn("", "danger", deleteCallback, "HelpRequestTable"),
     );
   }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:75:57
   }
 
   return (
-    <OurTable data={requests} columns={columns} testid={"HelpRequestTable"} />
+    <OurTable data={requests} columns={columns} testid={""} />
   );
 }
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid=""
