[Killed] BooleanLiteral
main/pages/HelpRequests/HelpRequestEditPage.jsx:8:59
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function HelpRequestEditPage({ storybook = false }) {
+export default function HelpRequestEditPage({ storybook = true }) {
   let { id } = useParams();
 
killedBy: HelpRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called with arguments: [ { to: '/helprequests' } ]

Number of calls: 0

[Killed] ObjectLiteral
main/pages/HelpRequests/HelpRequestEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/helprequests?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/helprequests`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: HelpRequestEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-teamId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestEditPage.jsx:21:12
     {
       // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
       method: "GET",
-      url: `/api/helprequests`,
+      url: ``,
       params: {
         id,
killedBy: HelpRequestEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-teamId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/HelpRequests/HelpRequestEditPage.jsx:22:15
       // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/helprequests`,
-      params: {
-        id,
-      },
+      params: {},
     },
   );
killedBy: HelpRequestEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-teamId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/HelpRequests/HelpRequestEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (helpRequest) => ({
-    url: "/api/helprequests",
-    method: "PUT",
-    params: {
-      id: helpRequest.id,
-    },
-    data: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "HelpRequest Updated - id: 17 requesterEmail: student@example2.edu",

[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestEditPage.jsx:30:13
 
   const objectToAxiosPutParams = (helpRequest) => ({
     url: "/api/helprequests",
-    method: "PUT",
+    method: "",
     params: {
       id: helpRequest.id,
killedBy: HelpRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "HelpRequest Updated - id: 17 requesterEmail: student@example2.edu",

[Killed] ObjectLiteral
main/pages/HelpRequests/HelpRequestEditPage.jsx:31:13
   const objectToAxiosPutParams = (helpRequest) => ({
     url: "/api/helprequests",
     method: "PUT",
-    params: {
-      id: helpRequest.id,
-    },
+    params: {},
     data: {
       requesterEmail: helpRequest.requesterEmail,
killedBy: HelpRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected {} to deeply equal { id: 17 }

[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestEditPage.jsx:44:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `HelpRequest Updated - id: ${helpRequest.id} requesterEmail: ${helpRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
main/pages/HelpRequests/HelpRequestEditPage.jsx:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit HelpRequest</h1>
-        {helpRequest && (
-          <HelpRequestForm
-            initialContents={helpRequest}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: HelpRequestEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-teamId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/HelpRequests/HelpRequestEditPage.jsx:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit HelpRequest</h1>
-        {helpRequest && (
-          <HelpRequestForm
-            initialContents={helpRequest}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: HelpRequestEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-teamId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
