[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestIndexPage.jsx:11:30
 export default function HelpRequestIndexPage() {
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/helprequests/create"
-          style={{ float: "right" }}
-        >
-          Create HelpRequest
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   const {
killedBy: HelpRequestIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create HelpRequest/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestIndexPage.jsx:12:45
   const currentUser = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/helprequests/create"
-          style={{ float: "right" }}
-        >
-          Create HelpRequest
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: HelpRequestIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create HelpRequest/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/HelpRequests/HelpRequestIndexPage.jsx:17:18
         <Button
           variant="primary"
           href="/helprequests/create"
-          style={{ float: "right" }}
+          style={{}}
         >
           Create HelpRequest
killedBy: HelpRequestIndexPage tests Renders with Create Button for admin user
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestIndexPage.jsx:32:27
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/helprequests/all"],
-    { method: "GET", url: "/api/helprequests/all" },
+    { method: "GET", url: "" },
     [],
   );
killedBy: HelpRequestIndexPage tests renders three helprequests correctly for regular user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
