[Killed] BooleanLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:8:62
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function MenuItemReviewEditPage({ storybook = false }) {
+export default function MenuItemReviewEditPage({ storybook = true }) {
   let { id } = useParams();
 
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: expected "spy" to be called with arguments: [ { to: '/menuitemreview' } ]

Number of calls: 0

[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:22:15
       // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/menuitemreview`,
-      params: {
-        id,
-      },
+      params: {},
     },
   );
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (menuItemReview) => ({
-    url: "/api/menuitemreview",
-    method: "PUT",
-    params: {
-      id: menuItemReview.id,
-    },
-    data: {
-      itemId: menuItemReview.itemId,
-      reviewerEmail: menuItemReview.reviewerEmail,
-      stars: menuItemReview.stars,
-      dateReviewed: menuItemReview.dateReviewed,
-      comments: menuItemReview.comments,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (review) => {
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "MenuItemReview Updated - id: 17 itemId: 2",

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:29:10
   );
 
   const objectToAxiosPutParams = (menuItemReview) => ({
-    url: "/api/menuitemreview",
+    url: "",
     method: "PUT",
     params: {
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "MenuItemReview Updated - id: 17 itemId: 2",

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:30:13
 
   const objectToAxiosPutParams = (menuItemReview) => ({
     url: "/api/menuitemreview",
-    method: "PUT",
+    method: "",
     params: {
       id: menuItemReview.id,
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "MenuItemReview Updated - id: 17 itemId: 2",

[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:31:13
   const objectToAxiosPutParams = (menuItemReview) => ({
     url: "/api/menuitemreview",
     method: "PUT",
-    params: {
-      id: menuItemReview.id,
-    },
+    params: {},
     data: {
       itemId: menuItemReview.itemId,
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: expected {} to deeply equal { id: 17 }

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:43:33
     },
   });
 
-  const onSuccess = (review) => {
-    toast(`MenuItemReview Updated - id: ${review.id} itemId: ${review.itemId}`);
-  };
+  const onSuccess = (review) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit MenuItemReview</h1>
-        {menuItemReview && (
-          <MenuItemReviewForm
-            initialContents={menuItemReview}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit MenuItemReview</h1>
-        {menuItemReview && (
-          <MenuItemReviewForm
-            initialContents={menuItemReview}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
