[Killed] BooleanLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:9:15
 import { toast } from "react-toastify";
 
 export default function UCSBDiningCommonsMenuItemEditPage({
-  storybook = false,
+  storybook = true,
 }) {
   let { id } = useParams();
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:23:12
     {
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
-      url: `/api/ucsbdiningcommonsmenuitem`,
+      url: ``,
       params: {
         id,
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:30:34
     },
   );
 
-  const objectToAxiosPutParams = (ucsbdiningcommonsmenuitem) => ({
-    url: "/api/ucsbdiningcommonsmenuitem",
-    method: "PUT",
-    params: {
-      id: ucsbdiningcommonsmenuitem.id,
-    },
-    data: {
-      diningCommonsCode: ucsbdiningcommonsmenuitem.diningCommonsCode,
-      name: ucsbdiningcommonsmenuitem.name,
-      station: ucsbdiningcommonsmenuitem.station,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbdiningcommonsmenuitem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "ucsbdiningcommonsmenuitem Updated - id: 17 name: noodles",

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:30:66
     },
   );
 
-  const objectToAxiosPutParams = (ucsbdiningcommonsmenuitem) => ({
-    url: "/api/ucsbdiningcommonsmenuitem",
-    method: "PUT",
-    params: {
-      id: ucsbdiningcommonsmenuitem.id,
-    },
-    data: {
-      diningCommonsCode: ucsbdiningcommonsmenuitem.diningCommonsCode,
-      name: ucsbdiningcommonsmenuitem.name,
-      station: ucsbdiningcommonsmenuitem.station,
-    },
-  });
+  const objectToAxiosPutParams = (ucsbdiningcommonsmenuitem) => ({});
 
   const onSuccess = (ucsbdiningcommonsmenuitem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "ucsbdiningcommonsmenuitem Updated - id: 17 name: noodles",

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:31:10
   );
 
   const objectToAxiosPutParams = (ucsbdiningcommonsmenuitem) => ({
-    url: "/api/ucsbdiningcommonsmenuitem",
+    url: "",
     method: "PUT",
     params: {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "ucsbdiningcommonsmenuitem Updated - id: 17 name: noodles",

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:32:13
 
   const objectToAxiosPutParams = (ucsbdiningcommonsmenuitem) => ({
     url: "/api/ucsbdiningcommonsmenuitem",
-    method: "PUT",
+    method: "",
     params: {
       id: ucsbdiningcommonsmenuitem.id,
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "ucsbdiningcommonsmenuitem Updated - id: 17 name: noodles",

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:43:52
     },
   });
 
-  const onSuccess = (ucsbdiningcommonsmenuitem) => {
-    toast(
-      `ucsbdiningcommonsmenuitem Updated - id: ${ucsbdiningcommonsmenuitem.id} name: ${ucsbdiningcommonsmenuitem.name}`,
-    );
-  };
+  const onSuccess = (ucsbdiningcommonsmenuitem) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:45:7
 
   const onSuccess = (ucsbdiningcommonsmenuitem) => {
     toast(
-      `ucsbdiningcommonsmenuitem Updated - id: ${ucsbdiningcommonsmenuitem.id} name: ${ucsbdiningcommonsmenuitem.name}`,
+      ``,
     );
   };
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "ucsbdiningcommonsmenuitem Updated - id: 17 name: noodles",

[Killed] LogicalOperator
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Item</h1>
-        {ucsbdiningcommonsmenuitem && (
-          <UCSBDiningCommonsMenuItemForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={ucsbdiningcommonsmenuitem}
-          />
-        )}
+        {ucsbdiningcommonsmenuitem || <UCSBDiningCommonsMenuItemForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={ucsbdiningcommonsmenuitem} />}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Item</h1>
-        {ucsbdiningcommonsmenuitem && (
-          <UCSBDiningCommonsMenuItemForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={ucsbdiningcommonsmenuitem}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:73:26
         {ucsbdiningcommonsmenuitem && (
           <UCSBDiningCommonsMenuItemForm
             submitAction={onSubmit}
-            buttonLabel={"Update"}
+            buttonLabel={""}
             initialContents={ucsbdiningcommonsmenuitem}
           />
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Update
Received:
