[Killed] StringLiteral
main/components/Articles/ArticleForm.jsx:99:24
           id="email"
           type="text"
           isInvalid={Boolean(errors.email)}
-          {...register("email", {
+          {...register("", {
             required: "Email is required.",
           })}
killedBy: ArticleForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Articles/ArticleForm.jsx:100:23
           type="text"
           isInvalid={Boolean(errors.email)}
           {...register("email", {
-            required: "Email is required.",
+            required: "",
           })}
         />
killedBy: ArticleForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticleForm.jsx:114:37
           id="dateAdded"
           type="datetime-local"
           isInvalid={Boolean(errors.dateAdded)}
-          {...register("dateAdded", {
-            required: true,
-            pattern: isodate_regex,
-          })}
+          {...register("dateAdded", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticleForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /DateAdded is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
