[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/ucsborganization/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/ucsborganization/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:47:5
       header: "orgCode",
       accessorKey: "orgCode",
     },
-    {
-      header: "orgTranslationShort",
-      accessorKey: "orgTranslationShort",
-    },
+    {},
     {
       header: "orgTranslation",
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:48:15
       accessorKey: "orgCode",
     },
     {
-      header: "orgTranslationShort",
+      header: "",
       accessorKey: "orgTranslationShort",
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: orgTranslationShort. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:52:15
       accessorKey: "orgTranslationShort",
     },
     {
-      header: "orgTranslation",
+      header: "",
       accessorKey: "orgTranslation",
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: orgTranslation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:55:5
       header: "orgTranslation",
       accessorKey: "orgTranslation",
     },
-    {
-      header: "inactive",
-      accessorKey: "inactive",
-    },
+    {},
   ];
 
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header
