[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:23:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `New recommendation request Created - id: ${recommendationRequest.id} requester email: ${recommendationRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0
