[Killed] BooleanLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:8:15
 import { toast } from "react-toastify";
 
 export default function UCSBDiningCommonsMenuItemCreatePage({
-  storybook = false,
+  storybook = true,
 }) {
   const objectToAxiosParams = (item) => ({
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /UCSBDiningCommonsMenuItem
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:10:31
 export default function UCSBDiningCommonsMenuItemCreatePage({
   storybook = false,
 }) {
-  const objectToAxiosParams = (item) => ({
-    url: "/api/ucsbdiningcommonsmenuitem/post",
-    method: "POST",
-    params: {
-      diningCommonsCode: item.diningCommonsCode,
-      name: item.name,
-      station: item.station,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (item) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /UCSBDiningCommonsMenuItem
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:13:13
   const objectToAxiosParams = (item) => ({
     url: "/api/ucsbdiningcommonsmenuitem/post",
     method: "POST",
-    params: {
-      diningCommonsCode: item.diningCommonsCode,
-      name: item.name,
-      station: item.station,
-    },
+    params: {},
   });
 
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /UCSBDiningCommonsMenuItem
statusReason: expected {} to deeply equal { name: 'Taco', …(2) }

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:20:31
     },
   });
 
-  const onSuccess = (item) => {
-    toast(`New item Created - id: ${item.id} name: ${item.name}`);
-  };
+  const onSuccess = (item) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /UCSBDiningCommonsMenuItem
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:21:11
   });
 
   const onSuccess = (item) => {
-    toast(`New item Created - id: ${item.id} name: ${item.name}`);
+    toast(``);
   };
 
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /UCSBDiningCommonsMenuItem
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New item Created - id: 1 name: Taco",
