[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.jsx:19:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/ucsbdiningcommonsmenuitem/all"],
-    { method: "GET", url: "/api/ucsbdiningcommonsmenuitem/all" },
+    { method: "", url: "/api/ucsbdiningcommonsmenuitem/all" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: UCSBDiningCommonsMenuItemIndexPage tests renders empty table when backend unavailable, user only
statusReason: expected 'Error communicating with backend via …' to match 'Error communicating with backend via …'

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.jsx:24:30
     [],
   );
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/ucsbdiningcommonsmenuitem/create"
-          style={{ float: "right" }}
-        >
-          Create Item
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   return (
killedBy: UCSBDiningCommonsMenuItemIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create Item/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.jsx:30:18
         <Button
           variant="primary"
           href="/ucsbdiningcommonsmenuitem/create"
-          style={{ float: "right" }}
+          style={{}}
         >
           Create Item
killedBy: UCSBDiningCommonsMenuItemIndexPage tests Renders with Create Button for admin user
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
