[Killed] LogicalOperator
main/components/HelpRequests/HelpRequestForm.jsx:34:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="HelpRequestForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="HelpRequestForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col>
killedBy: HelpRequestForm tests renders correctly (create mode)
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:59:27
               type="text"
               isInvalid={Boolean(errors.requesterEmail)}
               {...register("requesterEmail", {
-                required: "Email is required.",
+                required: "",
                 pattern: {
                   value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
killedBy: HelpRequestForm tests shows required messages on missing input
statusReason: Unable to find an element with the text: /Email is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:60:26
               isInvalid={Boolean(errors.requesterEmail)}
               {...register("requesterEmail", {
                 required: "Email is required.",
-                pattern: {
-                  value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
-                  message: "Enter a valid email."
-                }
+                pattern: {}
               })}
             />
killedBy: HelpRequestForm tests shows correct error messages on bad input
statusReason: Unable to find an element with the text: /Enter a valid email\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] Regex
main/components/HelpRequests/HelpRequestForm.jsx:61:26
               {...register("requesterEmail", {
                 required: "Email is required.",
                 pattern: {
-                  value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
+                  value: /^[^\S@]+@[^\s@]+\.[^\s@]+$/,
                   message: "Enter a valid email."
                 }
killedBy: HelpRequestForm tests no error messages on good input and submitAction called
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:62:28
                 required: "Email is required.",
                 pattern: {
                   value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
-                  message: "Enter a valid email."
+                  message: ""
                 }
               })}
killedBy: HelpRequestForm tests shows correct error messages on bad input
statusReason: Unable to find an element with the text: /Enter a valid email\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:80:26
               id="requestTime"
               type="text"
                 isInvalid={Boolean(errors.requestTime)}
-            {...register("requestTime", {
+            {...register("", {
                 required: "Request time is required.",
                 pattern: { value: isodate_regex, message: "Use ISO format (e.g., 2025-10-30T14:30)." },
killedBy: HelpRequestForm tests renders correctly (create mode)
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:81:27
               type="text"
                 isInvalid={Boolean(errors.requestTime)}
             {...register("requestTime", {
-                required: "Request time is required.",
+                required: "",
                 pattern: { value: isodate_regex, message: "Use ISO format (e.g., 2025-10-30T14:30)." },
             })}
killedBy: HelpRequestForm tests shows required messages on missing input
statusReason: Unable to find an element with the text: /Request time is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:82:26
                 isInvalid={Boolean(errors.requestTime)}
             {...register("requestTime", {
                 required: "Request time is required.",
-                pattern: { value: isodate_regex, message: "Use ISO format (e.g., 2025-10-30T14:30)." },
+                pattern: {},
             })}
 
killedBy: HelpRequestForm tests shows correct error messages on bad input
statusReason: Unable to find an element with the text: /Use ISO format \(e\.g\., 2025-10-30T14:30\)\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:82:59
                 isInvalid={Boolean(errors.requestTime)}
             {...register("requestTime", {
                 required: "Request time is required.",
-                pattern: { value: isodate_regex, message: "Use ISO format (e.g., 2025-10-30T14:30)." },
+                pattern: { value: isodate_regex, message: "" },
             })}
 
killedBy: HelpRequestForm tests shows correct error messages on bad input
statusReason: Unable to find an element with the text: /Use ISO format \(e\.g\., 2025-10-30T14:30\)\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:102:28
               id="teamId"
               type="text"
               isInvalid={Boolean(errors.teamId)}
-              {...register("teamId", {
+              {...register("", {
                 required: "Team ID is required.",
               })}
killedBy: HelpRequestForm tests renders correctly (create mode)
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:103:27
               type="text"
               isInvalid={Boolean(errors.teamId)}
               {...register("teamId", {
-                required: "Team ID is required.",
+                required: "",
               })}
             />
killedBy: HelpRequestForm tests shows required messages on missing input
statusReason: Unable to find an element with the text: /Team ID is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:122:28
               type="text"
               isInvalid={Boolean(errors.tableOrBreakoutRoom)}
 
-              {...register("tableOrBreakoutRoom", {
+              {...register("", {
                 required: "This field is required.",
               })}
killedBy: HelpRequestForm tests renders correctly (create mode)
statusReason: Cannot read properties of undefined (reading '_f')
