[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.jsx:33:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid={testIdPrefix + "-id"}
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid={testIdPrefix + "-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col>
killedBy: MenuItemReviewForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.jsx:33:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid={testIdPrefix + "-id"}
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: MenuItemReviewForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:53:43
           <Form.Group className="mb-3">
             <Form.Label htmlFor="itemId">ItemId</Form.Label>
             <Form.Control
-              data-testid={testIdPrefix + "-itemId"}
+              data-testid={testIdPrefix + ""}
               id="itemId"
               type="number"
killedBy: MenuItemReviewForm tests itemId and Stars are submitted as numbers
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-itemId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:57:38
               id="itemId"
               type="number"
               isInvalid={Boolean(errors.itemId)}
-              {...register("itemId", {
-                required: "ItemId is required.",
-                valueAsNumber: true,
-                min: { value: 1, message: "itemId must be > 0" },
-              })}
+              {...register("itemId", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /ItemId is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:58:27
               type="number"
               isInvalid={Boolean(errors.itemId)}
               {...register("itemId", {
-                required: "ItemId is required.",
+                required: "",
                 valueAsNumber: true,
                 min: { value: 1, message: "itemId must be > 0" },
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /ItemId is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:59:32
               isInvalid={Boolean(errors.itemId)}
               {...register("itemId", {
                 required: "ItemId is required.",
-                valueAsNumber: true,
+                valueAsNumber: false,
                 min: { value: 1, message: "itemId must be > 0" },
               })}
killedBy: MenuItemReviewForm tests itemId and Stars are submitted as numbers
statusReason: expected 'string' to be 'number' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:60:43
               {...register("itemId", {
                 required: "ItemId is required.",
                 valueAsNumber: true,
-                min: { value: 1, message: "itemId must be > 0" },
+                min: { value: 1, message: "" },
               })}
             />
killedBy: MenuItemReviewForm tests itemId shows correct error message for < 1
statusReason: Unable to find an element with the text: /itemId must be > 0/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:75:43
           <Form.Group className="mb-3">
             <Form.Label htmlFor="reviewerEmail">Reviewer Email</Form.Label>
             <Form.Control
-              data-testid={testIdPrefix + "-reviewerEmail"}
+              data-testid={testIdPrefix + ""}
               id="reviewerEmail"
               type="text"
killedBy: MenuItemReviewForm tests itemId and Stars are submitted as numbers
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-reviewerEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:80:27
               type="text"
               isInvalid={Boolean(errors.reviewerEmail)}
               {...register("reviewerEmail", {
-                required: "reviewer's Email is required.",
+                required: "",
                 pattern: {
                   value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /reviewer's Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:81:26
               isInvalid={Boolean(errors.reviewerEmail)}
               {...register("reviewerEmail", {
                 required: "reviewer's Email is required.",
-                pattern: {
-                  value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
-                  message: "invalid email",
-                },
+                pattern: {},
               })}
             />
killedBy: MenuItemReviewForm tests rejects incorrect email (front incorrect) and displays error message
statusReason: Unable to find an element with the text: /invalid email/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:103:32
               isInvalid={Boolean(errors.stars)}
               {...register("stars", {
                 required: "stars are required.",
-                valueAsNumber: true,
+                valueAsNumber: false,
                 min: {
                   value: 1,
killedBy: MenuItemReviewForm tests itemId and Stars are submitted as numbers
statusReason: expected 'string' to be 'number' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:130:44
               id="dateReviewed"
               type="datetime-local"
               isInvalid={Boolean(errors.dateReviewed)}
-              {...register("dateReviewed", {
-                required: "date reviewed is required.",
-                pattern: isodate_regex,
-              })}
+              {...register("dateReviewed", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /date reviewed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:145:43
           <Form.Group className="mb-3">
             <Form.Label htmlFor="comments">Comments</Form.Label>
             <Form.Control
-              data-testid={testIdPrefix + "-comments"}
+              data-testid={testIdPrefix + ""}
               id="comments"
               type="text"
killedBy: MenuItemReviewForm tests itemId and Stars are submitted as numbers
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-comments"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:149:28
               id="comments"
               type="text"
               isInvalid={Boolean(errors.comments)}
-              {...register("comments", {
+              {...register("", {
                 required: "comments are required.",
                 maxLength: {
killedBy: MenuItemReviewForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:150:27
               type="text"
               isInvalid={Boolean(errors.comments)}
               {...register("comments", {
-                required: "comments are required.",
+                required: "",
                 maxLength: {
                   value: 500,
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /comments are required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:153:28
                 required: "comments are required.",
                 maxLength: {
                   value: 500,
-                  message: "max 500 characters",
+                  message: "",
                 },
               })}
killedBy: MenuItemReviewForm tests comments have a max length of 500 chars
statusReason: Unable to find an element with the text: /max 500 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
